- Data Visualization is a small part of the overall EDA process

- EDA - Exploratory Data Analysis

- Data Science - Data Analysts --->

- Data Analysts ---> 
    - tools like Power BI 
    - Tableau 
    - Large volumes of data - large quantity 
        - 300 rows is not large 
        - 10K around data fair ammout of data
        - 400K rows of data
  
- To be able to find data - data sources

- import that data into your python files (1)

- should be able to analyse it (2)
    - by using visualization tools we learnt
    - matplotlib and seaborn
    -

- 1. Find data related to the titanic ship
    - download it
    - import to nbs
    - make some visualisations
    - and finally, write 4 lines about the data (give some information about the data that is not easily observable - make some judgements/ inferences)

In [2]:
import seaborn as sns

titanic = sns.load_dataset('titanic')

titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [3]:
titanic = titanic.dropna()

In [4]:
titanic['age'] = titanic['age'].astype(int)
titanic

C:\Users\devid\AppData\Local\Temp\ipykernel_16236\1824805563.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  titanic['age'] = titanic['age'].astype(int)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,47,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,33,0,0,5.0000,S,First,man,True,B,Southampton,no,True
879,1,1,female,56,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [5]:
titanic['fare'] = titanic['fare'].round(2)
titanic

C:\Users\devid\AppData\Local\Temp\ipykernel_16236\4195265605.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  titanic['fare'] = titanic['fare'].round(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38,1,0,71.28,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35,1,0,53.10,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54,0,0,51.86,S,First,man,True,E,Southampton,no,True
10,1,3,female,4,1,1,16.70,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58,0,0,26.55,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,47,1,1,52.55,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,33,0,0,5.00,S,First,man,True,B,Southampton,no,True
879,1,1,female,56,0,1,83.16,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True

- Finding the data (first  challenge!!!!)

### Data Sources

- **Primary** Source
    - data that we collect ourselves
    - problem - people you meet?
    - sensor data - 
        - sensors sense environment data -
            - proximity sensors - if you are close to the door
            - temperature sensor
            - 
    - you have to invest time, effort into this
    - need infrastructure 
    - even money
    - reasearchers, people who have some incentive like 
    
- **Secondary** - Rely on this a lot
    - data that you get from someone else
    - computer, looking for data and you download it
    - 
    - 
    - Kaggle
    - government datasets
    - github
    - uci
    - un datasets

In [6]:
x = np.random.randint(1,10,(50,)) # start, stop, (shape)
x

array([4, 7, 6, 9, 5, 9, 5, 1, 8, 9, 7, 2, 3, 9, 3, 8, 3, 1, 9, 9, 3, 3,
       5, 6, 5, 1, 4, 8, 7, 5, 1, 9, 7, 7, 6, 9, 4, 3, 1, 6, 3, 7, 6, 8,
       4, 4, 7, 5, 7, 1])

In [7]:
# generate a dataset

import numpy as np

np.random.seed(50)

a = np.random.randint(5000000,8000000,(10000000,)) # start and stop , size 
b = np.random.randint(5000000,10000000,(10000000,)) # start and stop
c = np.random.randint(5000000,25000000,(10000000,)) # start and stop
d = np.random.randint(5000000,55000000,(10000000,)) # start and stop

In [8]:
import pandas as pd

population = {
    'KL': a,
    'JB': b,
    'SG': c,
    'PJ':d
}

df = pd.DataFrame(population)

df.tail()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000000 entries, 0 to 9999999
Data columns (total 4 columns):
 #   Column  Dtype
---  ------  -----
 0   KL      int32
 1   JB      int32
 2   SG      int32
 3   PJ      int32
dtypes: int32(4)
memory usage: 152.6 MB

In [9]:
df

              KL       JB        SG        PJ
0        6980080  7572641  16894913  48777787
1        6152480  8458497  24059414  45149703
2        7336651  5712620  15837906  16401368
3        5677997  8176183  13403896   8868218
4        7538785  7467404  19645169  21835620
...          ...      ...       ...       ...
9999995  6988991  5952229   8148652  18447645
9999996  7553140  8509587  21065918  15777061
9999997  5491824  8409048  22352093  45368851
9999998  5045462  9579012  14602223  34216124
9999999  7624308  6061279  13391187  51238240

[10000000 rows x 4 columns]

In [10]:
# df.to_csv('testpopulation.csv')

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000000 entries, 0 to 9999999
Data columns (total 4 columns):
 #   Column  Dtype
---  ------  -----
 0   KL      int32
 1   JB      int32
 2   SG      int32
 3   PJ      int32
dtypes: int32(4)
memory usage: 152.6 MB

In [12]:
df.shape

(10000000, 4)

In [ ]:
# when we import any data
# csv file
# sometimes might just be data, and no headers
# table headers

column1 column2 column3

- you know that you need to remove the top row, which holds names of the coulumns

- you need to assign new names!!!

In [18]:
# import pandas as pd

df = pd.read_csv('iris.csv')
df.head(2)

     d  d.1    f  f.1       a
0  5.1  3.5  1.4  0.2  setosa
1  4.9  3.0  1.4  0.2  setosa

In [4]:
df.shape

(150, 5)

In [ ]:
df['a'][149] # column then exact row # value
df['a'] # direct access to columns name (column label)
df[['a','d','f']]

             a    d    f
0       setosa  5.1  1.4
1       setosa  4.9  1.4
2       setosa  4.7  1.3
3       setosa  4.6  1.5
4       setosa  5.0  1.4
..         ...  ...  ...
145  virginica  6.7  5.2
146  virginica  6.3  5.0
147  virginica  6.5  5.2
148  virginica  6.2  5.4
149  virginica  5.9  5.1

[150 rows x 3 columns]

In [42]:
x = [[11,22,33],
     [44,55,66]]
x[1][1] # rows columns

55

In [ ]:
# This is how you target a row
df.loc[4] # row

df["a"][8] # goes first to column, row

df.loc[0:10][['a','f','d','d','f']]   # row indexes (mostly numbers : slice) x column (names)

# slicing


# df[][] # column x rows
df.iloc[0:2][0:10] # column x rows

     d  d.1    f  f.1       a
0  5.1  3.5  1.4  0.2  setosa
1  4.9  3.0  1.4  0.2  setosa

In [56]:
df.head(2)

     d  d.1    f  f.1       a
0  5.1  3.5  1.4  0.2  setosa
1  4.9  3.0  1.4  0.2  setosa

In [64]:
columns = ['p_len','p_wid','s_len','s_wid','species']

iris = pd.read_csv('iris.csv', header = None, skiprows= 1, names= columns )
iris.head(2)

   p_len  p_wid  s_len  s_wid species
0    5.1    3.5    1.4    0.2  setosa
1    4.9    3.0    1.4    0.2  setosa

In [61]:
iris.shape

(150, 5)